namespace Sparrow.Video.Shortcuts
{
    public class Plan
    {
        /*
         * Что нужно для создания нарезки?
         * 1. Получить видео файлы +
         *      1.1. Обработать их (получить анализ)
         * 2. Произвести над ними обработку (перекодирование под один формат)
         *      2.1. Знать во что перекодировать
         *      2.2. Запустить процесс ffmpeg и начать кодирование
         * 3. Готовые файлы запихнуть в конвейер и просто склеить
         */

        /*
         * Инструменты:
         * 1. Clean Code
         * 2. DI
         * 3. FFmpeg (process)
         * 4. ShortcutEngine - in process
         */
    }
}